import numpy as np

p = dict()
l = dict()
theta = dict()
hd = np.pi/180
du = 180/np.pi

def k6_data(p,l,theta):
    # ThroatPlate_height = -174.519
    # l['tph'] = ThroatPlate_height

    # #针杆
    # p['1_a']  = np.array([0, 0, 0])
    # p['1_g2'] = np.array([0, 4, -17]) #针杆座孔位置
    # l['1_ab']   = 16.7 #针杆曲柄
    # l['1_bc']   = 53 #针杆连杆
    # l['1_cd']   = 78.619 #针杆连杆到针杆座
    # l['1_dd1']  = 2.8 #针间距
    # l['1_e1e2'] = 2.4 #针孔高低差
    # l['1_e2d']  = 43.7 #中针孔到针杆座
    # l['1_f2d']  = 48.9 #中针尖到针杆座
    theta['1_0ab'] = 90*hd #初始角度

    #挑线
    p['2_a']  = np.array([-116 ,0 ,0]) #轴心
    p['2_d']  = np.array([-116 ,0   ,-31]) #挑线轴轴心
    p['2_e']  = np.array([-116 ,41  ,-31]) #挑线杆旋转中心
    p['2_f1'] = np.array([49.5 ,0 ,27.5]) #短杆孔位置
    p['2_g1'] = np.array([100  ,0 ,25.5]) #长杆孔位置
    p['2_h']  = np.array([51.91320445 ,1.25 ,-13.31026001]) #下杆孔位置
    p['2_i1'] = np.array([5  ,32.95758774 ,-50.52536094]) #机壳上穿线孔左
    p['2_i2'] = np.array([0  ,32.95758774 ,-50.52536094]) #机壳上穿线孔中
    p['2_i3'] = np.array([-5 ,32.95758774 ,-50.52536094]) #机壳上穿线孔右
    p['2_j1'] = np.array([-135.53347593 ,46.5148213 ,42.5]) #火柴杆左
    p['2_j2'] = np.array([-129.9043108  ,49.7648213 ,32.5]) #火柴杆中
    p['2_j3'] = np.array([-124.27514568 ,53.0148213 ,22.5]) #火柴杆右
    p['2_k1'] = np.array([-159 ,58 ,2]) #硅油盒孔左
    p['2_k2'] = np.array([-159 ,63 ,2]) #硅油盒孔中
    p['2_k3'] = np.array([-159 ,68 ,2]) #硅油盒孔右
    l['2_ab']   = 4.5 #挑线偏心
    l['2_bc']   = 30 #挑线连杆
    l['2_cd']   = 21 #挑线摆杆
    l['2_f1f2'] = 5 #挑线孔间距
    l['2_f1f3'] = 10 #挑线孔间距
    theta['2_12'] = 0*hd
    theta['2_cex'] = 10*hd #挑线杆与挑线摆杆角度

if __name__ == '__main__':
    k6_data(p,l,theta)