import numpy as np
du = 180/np.pi
hd = np.pi/180
n = np.linspace(0,2*np.pi,361).reshape(-1,1)

# 固定点坐标
p1 = dict()
p1['a']    = np.array([48.45361005,-14.4466653,122.99683341])
p1['e']    = np.array([33.34691402,-7.56569624,122.99683341])
p1['g2']   = np.array([0,0,0])
p1['h2']   = np.array([68,0,-36])
p1['h2_1'] = np.array([68,5,-36])
p1['h2_2'] = np.array([68,-4.99,-36])
p1['j']    = np.array([67.99954954,5,-15.39983471])
p1['n']    = np.array([203,0,-7])
p1['d']    = np.array([4.2,0,18.81])
p1['d2']   = np.array([-10.2,0,18.81])
p1['m']    = np.array([2.55,0,18.86])
p1['m2']   = np.array([24.3,0,18.86])
p1['m3']   = np.array([29.7,0,18.86])
# 杆长
l1 = dict()
l1['ab']   = 2.45
l1['bc1']  = 125.4 
l1['c1c2'] = 113.61007878
l1['c2c3'] = 3.57
l1['c2c4'] = 136.3
l1['ef']   = 2.05
l1['fg1']  = 123.4
l1['g1g2'] = 29.2
l1['g3g4'] = 50
l1['g4h1'] = 57.1
l1['h1h2'] = 38.73512618
l1['h2h3'] = 3.97
l1['h2h5'] = 21.5
l1['h5c3'] = 97.26542294
l1['i1i2'] = 21.7
l1['i2i3'] = 71.6
l1['jk1']  = 12.6
l1['h2k2'] = 23.7
l1['k2i2'] = 25
l1['i3l1'] = 3.57
l1['l1l2'] = 95.2
l1['no']   = 0.73
# 角度
theta1 = dict()
theta1['shangzhou'] = 24.48885351*hd # 上轴与x轴夹角
theta1['g2g3g4'] = -40.32593142*hd
theta1['h1h2h3'] = 258.08086954*hd
theta1['h2h3i1'] = -90*hd
theta1['k1h2k2'] = -85*hd
theta1['oc2c3']  = 90*hd
theta1['0jk1']   = 135*hd
theta1['0no']    = -90*hd
theta1['ol1i3']  = 90*hd